readme adjustments, fix schema
